#!/usr/bin/env python
# -*-coding:utf-8 -*-
#***************************************************************************************************
# **  文件名称:       settings.py
# **  功能描述:       共用变量定义文件,文件中定义的变量可能会被多个文件、模块使用所以修改时请慎重
# **  创建者:
# **  创建日期:
# **  修改日志:
# **  修改日期:
# ** -----------------------------------------------------------------------------------------------
# **
# **  Copyright(c) 2014 AsiaInfo Technologies (China), Inc.
# **  All Rights Reserved.
#***************************************************************************************************

#***************************************************************************************************
# ** 常用变量、系统维护变量
#***************************************************************************************************
# 定义hive使用的数据仓库
hive_db  = "test"
# 定义hive仓库路径
dim_path = '/user/hive/warehouse/test.db'
dw_path  = '/user/hive/warehouse/test.db'
dwd_path = '/user/hive/warehouse/test.db'
st_path  = '/user/hive/warehouse/test.db'
#stg_path = '/user/hive/warehouse/test.db'
# 定义表存放路径
tmp_path = '/user/hive/TEMP'
# 定义hive表的存储格式
store_fmt = 'RCFILE'
# store_fmt = 'ORC'
